# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

from random import randint

lst = [randint(0, 9) for _ in range(1, 11)]
print(lst)

res = [i for i in lst if lst.count(i) == 1]
print(res)

# [7, 2, 9, 9, 7, 6, 5, 8, 1, 5]
# [2, 6, 8, 1]

# [0, 2, 1, 8, 3, 2, 1, 4, 8, 0]
# [3, 4]