# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
'''
Пример:
[2, 3, 4, 5, 6] => [12, 15, 16];
[2, 3, 5, 6] => [12, 15]
'''
import math

lst = [2, 3, 5, 6]
result = []

for i in range(0, math.ceil(len(lst) / 2)):
    result.append(lst[i] * lst[len(lst) - i - 1])

print(result)   # [12, 15]
