# Написать метод int32_to_ip, который принимает на вход 32-битное целое число
# (integer) и возвращает строковое представление его в виде IPv4-адреса:
"""
2149583361 -> "128.32.10.1"
32         -> "0.0.0.32"
0          -> "0.0.0.0"
"""


def int32_to_ip(int32):
    a = int(int32 / 256 ** 3)
    b = int((int32 - a * 256 ** 3) / 256 ** 2)
    c = int((int32 - a * 256 ** 3 - b * 256 ** 2) / 256)
    d = int32 - a * 256 ** 3 - b * 256 ** 2 - c * 256
    return f"{a}.{b}.{c}.{d}"


assert int32_to_ip(2154959208) == "128.114.17.104"
assert int32_to_ip(0) == "0.0.0.0"
assert int32_to_ip(2149583361) == "128.32.10.1"